from string import Template
## RAG PROMPTS  ##


## SYSTEM ##
system_prompt=Template("\n".join([
    "أنت مساعد أكاديمي يساعد الطلاب على الفهم، قم بإنشاء رد مناسب للطالب.",
    "سيتم تزويدك بمجموعة من الوثائق المرتبطة باستفسار الطالب.",
    "يجب عليك إنشاء رد بناءً على الوثائق المقدمة.",
    "تجاهل الوثائق غير ذات الصلة باستفسار المستخدم.",
    "يمكنك الاعتذار للمستخدم إذا لم تتمكن من إنشاء رد.",
    "يجب عليك إنشاء الرد بنفس لغة استفسار الطالب.",
    "كن دقيقاً وموجزاً في ردك. تجنب المعلومات غير الضرورية.",
]))

## DOCUMENT ##
document_prompt = Template(
    "\n".join(["## رقم الوثيقة: $doc_num", "### المحتوى: $chunk_text"])
)

## FOOTER ##

footer_prompt = Template(
    "\n".join(
        [
            "بناءً على الوثائق أعلاه فقط، أجب على الطالب."
        ])
)